mysql/location/log/20260818.124835.name.0016.txt
sysbench 1.1.1-94740b0 (using system LuaJIT 2.1.1767980792)

Running the test with following options:
Number of threads: 16
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Preparing queries
Preparing queries
Preparing queries
[...]
Threads started!

[ 1s ] thds: 16 tps: 157.16 qps: 329.23 (r/w/o: 329.23/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 16 tps: 164.26 qps: 328.53 (r/w/o: 328.53/0.00/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 16 tps: 169.53 qps: 339.06 (r/w/o: 339.06/0.00/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 16 tps: 166.37 qps: 331.74 (r/w/o: 331.74/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 16 tps: 166.19 qps: 334.39 (r/w/o: 334.39/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 16 tps: 165.75 qps: 331.51 (r/w/o: 331.51/0.00/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 16 tps: 166.51 qps: 333.02 (r/w/o: 333.02/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 16 tps: 171.22 qps: 341.43 (r/w/o: 341.43/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 16 tps: 168.17 qps: 337.34 (r/w/o: 337.34/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 167.08 qps: 333.16 (r/w/o: 333.16/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 16 tps: 168.40 qps: 334.79 (r/w/o: 334.79/0.00/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 16 tps: 159.58 qps: 322.16 (r/w/o: 322.16/0.00/0.00) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 16 tps: 165.96 qps: 329.92 (r/w/o: 329.92/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 16 tps: 168.50 qps: 339.01 (r/w/o: 339.01/0.00/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 168.98 qps: 335.95 (r/w/o: 335.95/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 16 tps: 168.60 qps: 336.21 (r/w/o: 336.21/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 16 tps: 164.55 qps: 332.10 (r/w/o: 332.10/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 16 tps: 166.37 qps: 332.73 (r/w/o: 332.73/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 16 tps: 170.09 qps: 339.17 (r/w/o: 339.17/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 163.92 qps: 328.84 (r/w/o: 328.84/0.00/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 16 tps: 167.99 qps: 334.98 (r/w/o: 334.98/0.00/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 16 tps: 166.50 qps: 333.00 (r/w/o: 333.00/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 16 tps: 169.76 qps: 338.53 (r/w/o: 338.53/0.00/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 16 tps: 168.73 qps: 339.46 (r/w/o: 339.46/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 160.34 qps: 317.67 (r/w/o: 317.67/0.00/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 16 tps: 152.69 qps: 308.38 (r/w/o: 308.38/0.00/0.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 16 tps: 152.98 qps: 303.97 (r/w/o: 303.97/0.00/0.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 16 tps: 166.15 qps: 333.31 (r/w/o: 333.31/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 16 tps: 161.36 qps: 323.72 (r/w/o: 323.72/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 170.47 qps: 339.94 (r/w/o: 339.94/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 16 tps: 170.56 qps: 342.13 (r/w/o: 342.13/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 16 tps: 163.95 qps: 326.91 (r/w/o: 326.91/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 16 tps: 162.96 qps: 326.92 (r/w/o: 326.92/0.00/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 16 tps: 165.07 qps: 330.14 (r/w/o: 330.14/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 167.66 qps: 333.32 (r/w/o: 333.32/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 16 tps: 165.81 qps: 332.62 (r/w/o: 332.62/0.00/0.00) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 16 tps: 158.51 qps: 318.02 (r/w/o: 318.02/0.00/0.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 16 tps: 152.89 qps: 305.77 (r/w/o: 305.77/0.00/0.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 16 tps: 164.75 qps: 329.49 (r/w/o: 329.49/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 165.86 qps: 329.72 (r/w/o: 329.72/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 16 tps: 159.66 qps: 319.32 (r/w/o: 319.32/0.00/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 16 tps: 157.62 qps: 314.25 (r/w/o: 314.25/0.00/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 16 tps: 164.24 qps: 329.49 (r/w/o: 329.49/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 16 tps: 158.77 qps: 319.54 (r/w/o: 319.54/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 158.71 qps: 315.42 (r/w/o: 315.42/0.00/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 16 tps: 160.50 qps: 323.00 (r/w/o: 323.00/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 16 tps: 165.24 qps: 330.47 (r/w/o: 330.47/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 16 tps: 161.74 qps: 323.48 (r/w/o: 323.48/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 16 tps: 162.53 qps: 325.05 (r/w/o: 325.05/0.00/0.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 163.17 qps: 326.34 (r/w/o: 326.34/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 16 tps: 153.84 qps: 307.68 (r/w/o: 307.68/0.00/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 16 tps: 156.20 qps: 312.40 (r/w/o: 312.40/0.00/0.00) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 16 tps: 159.32 qps: 318.65 (r/w/o: 318.65/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 16 tps: 163.50 qps: 326.99 (r/w/o: 326.99/0.00/0.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 150.09 qps: 300.18 (r/w/o: 300.18/0.00/0.00) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 16 tps: 158.40 qps: 315.80 (r/w/o: 315.80/0.00/0.00) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 16 tps: 161.06 qps: 323.12 (r/w/o: 323.12/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 16 tps: 164.76 qps: 327.52 (r/w/o: 327.52/0.00/0.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 16 tps: 160.26 qps: 322.53 (r/w/o: 322.53/0.00/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 162.84 qps: 324.67 (r/w/o: 324.67/0.00/0.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      49.213 |                                         1
      52.889 |                                         2
      53.850 |                                         1
      54.828 |                                         4
      55.824 |                                         3
      56.839 |                                         1
      57.871 |                                         4
      58.923 |                                         5
      59.993 |*                                        10
      61.083 |*                                        8
      62.193 |*                                        9
      63.323 |**                                       21
      64.474 |*                                        14
      65.645 |**                                       24
      66.838 |**                                       27
      68.053 |**                                       26
      69.289 |***                                      40
      70.548 |****                                     52
      71.830 |*****                                    66
      73.135 |*****                                    67
      74.464 |********                                 103
      75.817 |********                                 112
      77.194 |***********                              144
      78.597 |***********                              148
      80.025 |*************                            183
      81.479 |***************                          210
      82.959 |******************                       246
      84.467 |*********************                    289
      86.002 |*********************                    286
      87.564 |**************************               352
      89.155 |***************************              371
      90.775 |*********************************        451
      92.424 |***********************************      481
      94.104 |**********************************       463
      95.814 |***********************************      485
      97.555 |**************************************** 547
      99.327 |***************************************  538
     101.132 |*************************************    504
     102.969 |*********************************        453
     104.840 |*********************************        447
     106.745 |********************************         440
     108.685 |***************************              376
     110.659 |*************************                347
     112.670 |*********************                    291
     114.717 |***************                          207
     116.802 |***************                          208
     118.924 |*************                            180
     121.085 |***********                              145
     123.285 |*******                                  95
     125.525 |******                                   76
     127.805 |****                                     58
     130.128 |***                                      36
     132.492 |**                                       33
     134.899 |*                                        19
     137.350 |**                                       23
     139.846 |*                                        10
     142.387 |*                                        13
     144.974 |*                                        8
     147.608 |*                                        8
     150.290 |                                         2
     153.021 |                                         5
     155.801 |                                         4
     158.632 |                                         1
     161.514 |                                         3
     164.449 |                                         2
     167.437 |                                         4
     170.479 |                                         6
     173.577 |                                         2
     176.731 |*                                        7
     179.942 |                                         2
     183.211 |                                         1
     186.540 |                                         2
     189.929 |                                         3
     193.380 |                                         1
     196.894 |                                         2
     211.599 |                                         1
     215.443 |                                         1
     223.344 |                                         1
 
SQL statistics:
    queries performed:
        read:                            19642
        write:                           0
        other:                           0
        total:                           19642
    transactions:                        9821   (163.50 per sec.)
    queries:                             19642  (327.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      163.5028
    time elapsed:                        60.0663s
    total number of events:              9821

Latency (ms):
         min:                                  49.528
         avg:                                  97.819
         max:                                 224.923
         95th percentile:                     121.085
         sum:                              960676.185

Threads fairness:
    events (avg/stddev):           613.8125/5.98
    execution time (avg/stddev):   60.0423/0.02